Repository: tswsl1989/portalbot-twitter
Catalog: locales/*.po
Languages: it

source: running get_access_token.py is a way to get it
it: eseguire get_access_token.py è un modo per ottenerla

source: The consumer key of the application.
it: La chiave pubblica dell'applicazione (consumer key).

source: The consumer secret of the application.
it: La chiave privata dell'applicazione (consumer secret).

source: The Twitter Access Token key for the bot's account (%s)
it: La chiave d'accesso Twitter per l'account del bot (%s)

source: The Twitter Access Token secret for the bot's account (%s)
it: La chiave d'accesso Twitter segreta per l'account del bot (%s)

source: The URL to the base API URL (by default, it is Twitter.com, but you can use it for twitter-compatible services, such as identica/statusnet.
it: L'URI dell'URL di base per l'API (per impostazione predefinita è Twitter.com, ma è utilizzabile per servizi compatibili con Twitter come identica e statusnet.

source: The Twitter Access Token key for this channel's account (%s)
it: La chiave d'accesso Twitter per l'account di questo canale (%s)

source: The Twitter Access Token secret for this channel's account (%s)
it: La chiave d'accesso Twitter segreta per l'account di questo canale (%s)

source: Api with retweet support.
it: API con supporto per i retweet.

source: Retweet a tweet with the Retweet API The twitter.Api instance must be authenticated. Args: id: The numerical ID of the tweet you are retweeting Returns: A twitter.Status instance representing the retweet posted
it: Fa il retweet di un tweet con l'API Retweet. L'istanza di twitter.Api deve essere autenticata. Argomenti: id: l'ID numerico del tweet che stai ri-postando (retweet). Rinvii: Un'istanza di twitter.Status che rappresenta il retweet postato.

source: I just woke up. :)
it: Mi sono appena svegliato :)

source: [<channel>] [<user>] Replies with the people this <user> follows. If <user> is not given, it defaults to the <channel>'s account. If <channel> is not given, it defaults to the current channel.
it: [<canale>] [<utente>] Risponde alle persone seguite da <utente>. Se <utente> non è specificato il valore predefinito è l'account di <canale>. Se <canale> non è fornito usa quello attuale.

source: No account is associated with this channel. Ask an op, try with another channel, or provide a user name.
it: Nessun account associato a questo canale. Chiedi a un op, prova un altro canale o fornisci un nome utente.

source: [<channel>] Replies with the people that follow this account. If <channel> is not given, it defaults to the current channel.
it: [<canale>] Risponde alle persone che seguono questo account. Se <canale> non è fornito usa quello attuale.

source: [<channel>] <recipient> <message> Sends a <message> to <recipient> from the account associated with the given <channel>. If <channel> is not given, it defaults to the current channel.
it: [<canale>] <destinatario> <messaggio> Invia <messaggio> a <destinatario> dall'account associato con il dato <canale>. Se <canale> non è fornito usa quello attuale.

source: No account is associated with this channel. Ask an op or try with another channel.
it: Nessun account associato a questo canale. Chiedi a un op prova un altro canale.

source: Sorry, your message exceeds 140 characters (%i)
it: Spiacente, il tuo messaggio supera 140 caratteri (%i).

source: [<channel>] <message> Updates the status of the account associated with the given <channel> to the <message>. If <channel> is not given, it defaults to the current channel.
it: [<canale>] <messaggio> Aggiorna con <messaggio> lo stato dell'account associato a <canale>. Se <canale> non è fornito, usa quello attuale.

source: Sorry, your tweet exceeds 140 characters (%i)
it: Spiacente, il tuo tweet supera 140 caratteri (%i).

source: [<channel>] <id> Retweets the message with the given ID.
it: Fa il retweet del messaggio con il dato ID.

source: [<channel>] [--since <oldest>] [--max <newest>] [--count <number>] [--noretweet] [--with-id] [<user>] Replies with the timeline of the <user>. If <user> is not given, it defaults to the account associated with the <channel>. If <channel> is not given, it defaults to the current channel. If given, --since and --max take tweet IDs, used as boundaries. If given, --count takes an integer, that stands for the number of tweets to display. If --noretweet is given, only native user's tweet will be displayed.
it: [<canale>] [--since <più_vecchio>] [--max <più_recente>] [--count <numero>] [--noretweet] [--with-id] [<utente>] Risponde con la timeline di <utente>. Se <utente> non è specificato, il valore predefinito è l'account associato a <canale>. Se <canale> non è fornito usa quello attuale. Se forniti, --since e --max utilizzano gli ID dei tweet come limite della richiesta. Se --count è specificato, utilizza un numero intero come numero dei tweet da mostrare. Se viene usato --noretweet, saranno mostrati solo i tweet originari dell'utente.

source: No account is associated with this channel. Ask an op, try with another channel.
it: Nessun account associato a questo canale. Chiedi a un op o prova un altro canale.

source: This user protects his tweets; you need to fetch them from a channel whose associated account can fetch this timeline.
it: Questo utente protegge i suoi tweet; devi scaricarli da un canale il cui account associato può recuperare questa timeline.

source: [<channel>] [--since <oldest>] Replies with the public timeline. If <channel> is not given, it defaults to the current channel. If given, --since takes a tweet ID, used as a boundary
it: [<canale>] [--since <più_vecchio>] Risponde con la timeline pubblica. Se <canale> non è fornito usa quello attuale. Se --since è usato prende l'ID di un tweet come limite della richiesta.

source: No tweets
it: Nessun tweet.

source: [<channel>] [--since <oldest>] Replies with the replies timeline. If <channel> is not given, it defaults to the current channel. If given, --since takes a tweet ID, used as a boundary
it: [<canale>] [--since <più_vecchio>] Risponde con la timeline delle risposte. Se <canale> non è fornito usa quello attuale. Se --since è usato prende l'ID di un tweet come limite della richiesta.

source: [<channel>] Current trending topics If <channel> is not given, it defaults to the current channel.
it: [<canale>] Attuali topic di tendenza. Se <canale> non è fornito usa quello attuale.

source: [<channel>] <user> Follow a specified <user> If <channel> is not given, it defaults to the current channel.
it: [<canale>] <utente> Segue l'<utente> specificato. Se <canale> non è fornito usa quello attuale.

source: An error occurred
it: Si è verificato un errore.

source: [<channel>] <user> Unfollow a specified <user> If <channel> is not given, it defaults to the current channel.
it: [<canale>] <utente> Smette di seguire l'<utente> specificato. Se <canale> non è fornito usa quello attuale.

source: [<channel>] <id> Delete a specified status with id <id> If <channel> is not given, it defaults to the current channel.
it: [<canale>] <ID> Cancella uno stato specifico con <ID> Se <canale> non è fornito usa quello attuale.

source: [<channel>] Print some stats If <channel> is not given, it defaults to the current channel.
it: [<canale>] Mostra delle statistiche. Se <canale> non è fornito usa quello attuale.

source: [<channel>] <user> Return profile image for a specified <user> If <channel> is not given, it defaults to the current channel.
it: [<canale>] <utente> Riporta il profilo dell'<utente> specificato. Se <canale> non è fornito usa quello attuale.
